identity-service-master-master/identity-service-master-master/artillery/health_service_loadtest.yml
config:
  target: "https://dev.vemsalud.com"
  http:
    timeout: 120
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
scenarios: 
  - flow:
    - get: 
        url: "/identity-service/v1/health"
    name: "Health"